---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.CentralFileCommunicationException
source: html/1a8ceddf-a84b-08a1-afed-bfe8405c6a08.htm
---
# CentralFileCommunicationException Methods

Retrieves data needed to serialize the target object.